require("dotenv").config();
const TelegramBot = require("node-telegram-bot-api");
const cron = require("node-cron");

const bot = new TelegramBot(process.env.BOT_TOKEN, { polling: true });

// Логика, если кто-то пишет /start (опционально)
bot.onText(/\/start/, (msg) => {
  bot.sendMessage(
    msg.chat.id,
    "Всем привет! Меня зовут Геннадий Напоминалов. Я буду напоминать о репетиции раз в неделю. Пока я умею только это, но, если Сашке будет не лень, он под пиво добавит что-нибудь ещё"
  );
});

// Еженедельное напоминание (каждую пятницу в 10:25)
cron.schedule("* * * * *", () => {
  bot.sendMessage(
    process.env.CHAT_ID,
    "📅 Напоминание: в субботу репетиция в 21:00!"
  );
});
